In [1]:
import faker
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv('Titanic.tsv', sep='\t')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 894 entries, 0 to 893
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  894 non-null    int64
 1   Survived     894 non-null    int64
 2   Pclass       894 non-null    float64
 3   Name         894 non-null    object
 4   Sex          894 non-null    object
 5   Age          721 non-null    object
 6   SibSp        894 non-null    int64
 7   Parch        894 non-null    object
 8   Ticket       893 non-null    object
 9   Fare         893 non-null    object
 10  Cabin        208 non-null    object
 11  Embarked     892 non-null    object
 12  ship         894 non-null    object
dtypes: float64(1), int64(3), object(9)
memory usage: 90.9+ KB

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ship
0,1,0,3.0,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,"7,25",NaN,S,Titanic
1,2,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,"71,2833",C85,C,Titanic
2,3,1,3.0,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,"7,925",NaN,S,Titanic
3,4,1,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,"53,1",C123,S,Titanic
4,5,0,3.0,"Allen, Mr. William Henry",male,35,0,0,373450,"8,05",NaN,S,Titanic

In [5]:
df["Name"].describe()

count                                    894
unique                                   889
top       Sandstrom, Miss. Marguerite Ru&5$$
freq                                       4
Name: Name, dtype: object

In [6]:
df['Name'].value_counts()

Sandstrom, Miss. Marguerite Ru&5$$      4
Hoyt, Mr. Frederick Maxfield            2
Vestrom, Miss. Hulda Amanda Adolfina    2
Braund, Mr. Owen Harris                 1
Slabenoff, Mr. Petco                    1
                                       ..
Keane, Miss. Nora A                     1
Williams, Mr. Howard Hugh "Harry"       1
Allison, Master. Hudson Trevor          1
Fleming, Miss. Margaret                 1
Mr. Frederick Maxfield Hoyt             1
Name: Name, Length: 889, dtype: int64

### Fixing passengerid Column

In [7]:
df["PassengerId"].describe()

count     894.000000
mean      446.030201
std       259.208003
min       -12.000000
25%       223.250000
50%       444.500000
75%       668.750000
max      1143.000000
Name: PassengerId, dtype: float64

In [8]:
df["PassengerId"].value_counts()

 225    3
 11     3
 1      1
 603    1
 592    1
       ..
 304    1
 305    1
 306    1
 307    1
-12     1
Name: PassengerId, Length: 890, dtype: int64

##### Drop passengerid

In [9]:
df.drop(['PassengerId'], axis=1, inplace=True)

In [10]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ship
0,0,3.0,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,"7,25",NaN,S,Titanic
1,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,"71,2833",C85,C,Titanic
2,1,3.0,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,"7,925",NaN,S,Titanic
3,1,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,"53,1",C123,S,Titanic
4,0,3.0,"Allen, Mr. William Henry",male,35,0,0,373450,"8,05",NaN,S,Titanic

##### Creating new passengerid column

In [11]:
df['PassengerId'] = df.index + 1

In [12]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ship,PassengerId
0,0,3.0,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,"7,25",NaN,S,Titanic,1
1,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,"71,2833",C85,C,Titanic,2
2,1,3.0,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,"7,925",NaN,S,Titanic,3
3,1,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,"53,1",C123,S,Titanic,4
4,0,3.0,"Allen, Mr. William Henry",male,35,0,0,373450,"8,05",NaN,S,Titanic,5

In [13]:
df = df.loc[:,['PassengerId','Survived','Pclass','Name','Sex','Age','SibSp','Parch','Ticket','Fare','Cabin','Embarked','ship']]

In [14]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ship
0,1,0,3.0,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,"7,25",NaN,S,Titanic
1,2,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,"71,2833",C85,C,Titanic
2,3,1,3.0,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,"7,925",NaN,S,Titanic
3,4,1,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,"53,1",C123,S,Titanic
4,5,0,3.0,"Allen, Mr. William Henry",male,35,0,0,373450,"8,05",NaN,S,Titanic

In [15]:
df['PassengerId'].value_counts()

1      1
601    1
590    1
591    1
592    1
      ..
302    1
303    1
304    1
305    1
894    1
Name: PassengerId, Length: 894, dtype: int64

### Fixing survived columns

In [16]:
df['Survived'].value_counts()

 0    548
 1    345
-4      1
Name: Survived, dtype: int64

##### We have one value with -4, we are going to suppose that he dies. So i change -4 for 0

In [17]:
df['Survived'] = df['Survived'].replace(-4,0)

In [18]:
df['Survived'].value_counts()

0    549
1    345
Name: Survived, dtype: int64

### Fixing Pclass columns

In [19]:
df['Pclass'].value_counts()

 3.0    493
 1.0    216
 2.0    184
-2.0      1
Name: Pclass, dtype: int64

##### I am going to change the value -2.0 to 2.0

In [20]:
df['Pclass'] = df['Pclass'].replace(-2.0,2.0)

In [21]:
df['Pclass'].value_counts()

3.0    493
1.0    216
2.0    185
Name: Pclass, dtype: int64

##### And now i am going to change the name of this value by First,second and third class.

In [22]:
df['Pclass'] = df['Pclass'].replace([3.0, 2.0, 1.0], ['Third', 'Second', 'First'])

In [23]:
df['Pclass'].value_counts()

Third     493
First     216
Second    185
Name: Pclass, dtype: int64

In [24]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ship
0,1,0,Third,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,"7,25",NaN,S,Titanic
1,2,1,First,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,"71,2833",C85,C,Titanic
2,3,1,Third,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,"7,925",NaN,S,Titanic
3,4,1,First,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,"53,1",C123,S,Titanic
4,5,0,Third,"Allen, Mr. William Henry",male,35,0,0,373450,"8,05",NaN,S,Titanic

### Fixing Sex columns

In [25]:
df['Sex'].value_counts()

male       575
female     310
fem          2
malef        1
mal          1
femmale      1
feemale      1
Female       1
malee        1
F            1
Name: Sex, dtype: int64

##### We can see we have differents ways to write male and female, so we are going to fix this.

In [26]:
df['Sex'] = df['Sex'].replace('fem','female')
df['Sex'] = df['Sex'].replace('malef','male')
df['Sex'] = df['Sex'].replace('mal','male')
df['Sex'] = df['Sex'].replace('femmale','female')
df['Sex'] = df['Sex'].replace('feemale','female')
df['Sex'] = df['Sex'].replace('Female','female')
df['Sex'] = df['Sex'].replace('malee','male')
df['Sex'] = df['Sex'].replace('F','female')

In [27]:
df['Sex'].value_counts()

male      578
female    316
Name: Sex, dtype: int64

In [28]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ship
0,1,0,Third,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,"7,25",NaN,S,Titanic
1,2,1,First,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,"71,2833",C85,C,Titanic
2,3,1,Third,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,"7,925",NaN,S,Titanic
3,4,1,First,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,"53,1",C123,S,Titanic
4,5,0,Third,"Allen, Mr. William Henry",male,35,0,0,373450,"8,05",NaN,S,Titanic

### Fixing Age columns

In [29]:
df['Age'].value_counts()

24      30
22      27
18      26
19      25
28      24
        ..
12       1
70,5     1
66       1
.9       1
.7       1
Name: Age, Length: 94, dtype: int64

##### I am goint to change the value 70,5 and the others values with the point in front of them

In [30]:
df['Age'] = df['Age'].replace("70,5",70)
df['Age'] = df['Age'].replace(".9",9)
df['Age'] = df['Age'].replace(".7",7)

In [31]:
df['Age'].value_counts()

24    30
22    27
18    26
19    25
28    24
      ..
12     1
70     1
66     1
9      1
7      1
Name: Age, Length: 94, dtype: int64

In [32]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ship
0,1,0,Third,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,"7,25",NaN,S,Titanic
1,2,1,First,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,"71,2833",C85,C,Titanic
2,3,1,Third,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,"7,925",NaN,S,Titanic
3,4,1,First,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,"53,1",C123,S,Titanic
4,5,0,Third,"Allen, Mr. William Henry",male,35,0,0,373450,"8,05",NaN,S,Titanic

###  Fixing SibSp

In [33]:
df['SibSp'].value_counts()

0     606
1     213
2      28
4      18
3      16
8       7
5       5
70      1
Name: SibSp, dtype: int64

##### We cant have 70 siblings so i will change this for 7

In [42]:
df['SibSp'] = df['SibSp'].replace(70,7)

In [43]:
df['SibSp'].value_counts()

0    606
1    213
2     28
4     18
3     16
8      7
5      5
7      1
Name: SibSp, dtype: int64

###  Fixing Parch

In [34]:
df['Parch'].value_counts()

0     679
1     121
2      80
3       5
5       4
4       4
no      1
Name: Parch, dtype: int64

##### We can se there is one value with no we are going to change this to

In [48]:
df['Parch'] = df['Parch'].replace('no',0)

In [49]:
df['Parch'].value_counts()

0    679
1    121
2     80
3      5
5      4
4      4
0      1
Name: Parch, dtype: int64

### Fixing Fare

In [36]:
df['Fare'].value_counts()

8,05       43
13         42
7,8958     38
7,75       34
26         31
           ..
15,9        1
28,5        1
6,2375      1
14          1
10,5167     1
Name: Fare, Length: 251, dtype: int64

##### First we have a problem with one value with is not a number, so we change this.

In [53]:
df['Fare'] = df['Fare'].replace('07.maj',7.2)

##### Then we have to change "," for "."

In [54]:
df['Fare'] =df['Fare'].str.replace(",", ".").astype(float)

In [55]:
df['Fare'].value_counts()

8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
           ..
8.8500      1
12.8750     1
71.2833     1
12.2750     1
10.5167     1
Name: Fare, Length: 249, dtype: int64

##### And finally we can rounf the numbers.

In [56]:
df['Fare'] = np.round(df['Fare'], 2)

In [57]:
df['Fare'].value_counts()

8.05     43
13.00    42
7.90     38
7.75     34
26.00    31
         ..
61.38     1
12.65     1
12.00     1
21.68     1
10.52     1
Name: Fare, Length: 237, dtype: int64

In [58]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ship
0,1,0,Third,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,NaN,S,Titanic
1,2,1,First,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.28,C85,C,Titanic
2,3,1,Third,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.92,NaN,S,Titanic
3,4,1,First,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.10,C123,S,Titanic
4,5,0,Third,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,NaN,S,Titanic

### Fixing embarked

In [60]:
df['Embarked'].value_counts()

S     645
C     167
Q      76
So      2
Co      1
Qe      1
Name: Embarked, dtype: int64

##### We have 3 wrong ways to write the embarked door

In [64]:
df['Embarked'] = df['Embarked'].replace('So','S')
df['Embarked'] = df['Embarked'].replace('Co','C')
df['Embarked'] = df['Embarked'].replace('Qe','Q')

In [65]:
df['Embarked'].value_counts()

S    647
C    168
Q     77
Name: Embarked, dtype: int64

### Fixing ship

In [66]:
df['ship'].value_counts()

Titanic    892
Titani       1
Titnic       1
Name: ship, dtype: int64

##### We are goint to write Titanic in every options

In [67]:
df['ship'] = df['ship'].replace('Titani','Titanic')
df['ship'] = df['ship'].replace('Titnic','Titanic')

In [68]:
df['ship'].value_counts()

Titanic    894
Name: ship, dtype: int64

###  Fixing Cabin

In [78]:
df['Cabin'].isnull().sum()

686

##### I decide to drop the column because there are a lot of NaN Values.

In [79]:
df.drop(['Cabin'], axis=1, inplace=True)

In [80]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,ship
0,1,0,Third,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,S,Titanic
1,2,1,First,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.28,C,Titanic
2,3,1,Third,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.92,S,Titanic
3,4,1,First,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.10,S,Titanic
4,5,0,Third,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,S,Titanic

### Fixing Ticket

In [81]:
df['Ticket'].value_counts()

1601        7
CA. 2343    7
3101295     6
347082      6
347088      6
           ..
226593      1
9234        1
19988       1
2693        1
370376      1
Name: Ticket, Length: 680, dtype: int64

##### There is one NaN value so i will change this for no ticket information.

In [82]:
df['Ticket'].isnull().sum()

1

In [87]:
df['Ticket']=df['Ticket'].fillna('No Ticket Info')

In [88]:
df['Ticket'].isnull().sum()

0

### Names Fix

In [89]:
df['Name'].value_counts()

Sandstrom, Miss. Marguerite Ru&5$$      4
Hoyt, Mr. Frederick Maxfield            2
Vestrom, Miss. Hulda Amanda Adolfina    2
Braund, Mr. Owen Harris                 1
Slabenoff, Mr. Petco                    1
                                       ..
Keane, Miss. Nora A                     1
Williams, Mr. Howard Hugh "Harry"       1
Allison, Master. Hudson Trevor          1
Fleming, Miss. Margaret                 1
Mr. Frederick Maxfield Hoyt             1
Name: Name, Length: 889, dtype: int64

In [90]:
df['FirstName'] = df['Name'].str.split(',').str[1]

In [91]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,ship,FirstName
0,1,0,Third,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,S,Titanic,Mr. Owen Harris
1,2,1,First,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.28,C,Titanic,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,Third,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.92,S,Titanic,Miss. Laina
3,4,1,First,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.10,S,Titanic,Mrs. Jacques Heath (Lily May Peel)
4,5,0,Third,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,S,Titanic,Mr. William Henry

##### As we can see the name is not okay, so we are going to create 2 differents columns, one for the firstname and the other for the lastname

In [92]:
df['LastName'] = df['Name'].str.split(',').str[0]

In [93]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,ship,FirstName,LastName
0,1,0,Third,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,S,Titanic,Mr. Owen Harris,Braund
1,2,1,First,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.28,C,Titanic,Mrs. John Bradley (Florence Briggs Thayer),Cumings
2,3,1,Third,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.92,S,Titanic,Miss. Laina,Heikkinen
3,4,1,First,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.10,S,Titanic,Mrs. Jacques Heath (Lily May Peel),Futrelle
4,5,0,Third,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,S,Titanic,Mr. William Henry,Allen

##### And now we drop the Name column

In [94]:
df.drop(['Name'], axis=1, inplace=True)

In [95]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,ship,FirstName,LastName
0,1,0,Third,male,22,1,0,A/5 21171,7.25,S,Titanic,Mr. Owen Harris,Braund
1,2,1,First,female,38,1,0,PC 17599,71.28,C,Titanic,Mrs. John Bradley (Florence Briggs Thayer),Cumings
2,3,1,Third,female,26,0,0,STON/O2. 3101282,7.92,S,Titanic,Miss. Laina,Heikkinen
3,4,1,First,female,35,1,0,113803,53.10,S,Titanic,Mrs. Jacques Heath (Lily May Peel),Futrelle
4,5,0,Third,male,35,0,0,373450,8.05,S,Titanic,Mr. William Henry,Allen

In [96]:
df['FirstName'].value_counts()

 Mr. John                                                        7
 Mr. James                                                       7
 Miss. Mary                                                      6
 Mr. William                                                     6
 Miss. Bertha                                                    4
                                                                ..
 Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo)    1
 Miss. Laura Mabel                                               1
 Miss. Margaret Bechstein                                        1
 Miss. Emily Borie                                               1
 Mr. Karl Howell                                                 1
Name: FirstName, Length: 799, dtype: int64

##### Now i am goint do delete the title because i think it is not important for us.

In [98]:
df['FirstName'] = df['FirstName'].str.split('.').str[1]

In [99]:
df['FirstName'].value_counts()

 John                                                       9
 James                                                      7
 Mary                                                       6
 William                                                    6
 Marguerite Ru&5$$                                          4
                                                           ..
 Margaret                                                   1
 Victor de Satode (Maria Josefa Perez de Soto y Vallejo)    1
 Laura Mabel                                                1
 Margaret Bechstein                                         1
 Karl Howell                                                1
Name: FirstName, Length: 795, dtype: int64

In [101]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,ship,FirstName,LastName
0,1,0,Third,male,22,1,0,A/5 21171,7.25,S,Titanic,Owen Harris,Braund
1,2,1,First,female,38,1,0,PC 17599,71.28,C,Titanic,John Bradley (Florence Briggs Thayer),Cumings
2,3,1,Third,female,26,0,0,STON/O2. 3101282,7.92,S,Titanic,Laina,Heikkinen
3,4,1,First,female,35,1,0,113803,53.10,S,Titanic,Jacques Heath (Lily May Peel),Futrelle
4,5,0,Third,male,35,0,0,373450,8.05,S,Titanic,William Henry,Allen

##### I am goign to order all the information

In [103]:
df = df.loc[:,['PassengerId','Survived','Pclass','LastName','FirstName','Sex','Age','SibSp','Parch','Ticket','Fare','Embarked','ship']]

In [104]:
df.head()

,PassengerId,Survived,Pclass,LastName,FirstName,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,ship
0,1,0,Third,Braund,Owen Harris,male,22,1,0,A/5 21171,7.25,S,Titanic
1,2,1,First,Cumings,John Bradley (Florence Briggs Thayer),female,38,1,0,PC 17599,71.28,C,Titanic
2,3,1,Third,Heikkinen,Laina,female,26,0,0,STON/O2. 3101282,7.92,S,Titanic
3,4,1,First,Futrelle,Jacques Heath (Lily May Peel),female,35,1,0,113803,53.10,S,Titanic
4,5,0,Third,Allen,William Henry,male,35,0,0,373450,8.05,S,Titanic

In [105]:
df['LastName'].isnull().sum()

0

##### Now we can see that in the firstname column we have one NaN value, so we are goint to change this for No value

In [107]:
df['FirstName'].isnull().sum()

1

In [108]:
df['FirstName']=df['FirstName'].fillna('No Value')

In [109]:
df['FirstName'].isnull().sum()

0

In [110]:
df.head()

,PassengerId,Survived,Pclass,LastName,FirstName,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,ship
0,1,0,Third,Braund,Owen Harris,male,22,1,0,A/5 21171,7.25,S,Titanic
1,2,1,First,Cumings,John Bradley (Florence Briggs Thayer),female,38,1,0,PC 17599,71.28,C,Titanic
2,3,1,Third,Heikkinen,Laina,female,26,0,0,STON/O2. 3101282,7.92,S,Titanic
3,4,1,First,Futrelle,Jacques Heath (Lily May Peel),female,35,1,0,113803,53.10,S,Titanic
4,5,0,Third,Allen,William Henry,male,35,0,0,373450,8.05,S,Titanic

##### Finishing i am goint to see if we have some wrong value in our names.

In [112]:
df['LastName'].unique()

array(['Braund', 'Cumings', 'Heikkinen', 'Futrelle', 'Allen', 'Moran',
       'McCarthy', 'Palsson', 'Johnson', 'Nasser', 'Sandstrom', 'Bonnell',
       'Saundercock', 'Vestrom', 'Hewlett', 'Rice', 'Williams',
       'Vander Planke', 'Masselmani', 'Fynney', 'Beesley', 'McGowan',
       'Asplund', 'Emir', 'Fortune', "O'Dwyer", 'Todoroff', 'Uruchurtu',
       'Spencer', 'Glynn', 'Wheadon', 'Meyer', 'Holverson', 'Mamee',
       'Cann', 'Nicola-Yarred', 'Ahlin', 'Turpin', 'Kraeff', 'Laroche',
       'Devaney', 'Rogers', 'Lennon', "O'Driscoll", 'Samaan',
       'Arnold-Franchi', 'Panula', 'Nosworthy', 'Harper', 'Faunthorpe',
       'Ostby', 'Woolner', 'Rugg', 'Novel', 'West', 'Goodwin',
       'Sirayanian', 'Icard', 'Harris', 'Skoog', 'Stewart', 'Moubarek',
       'Nye', 'Crease', 'Andersson', 'Kink', 'Jenkin', 'Hood',
       'Chronopoulos', 'Bing', 'Moen', 'Staneff', 'Moutal', 'Caldwell',
       'Dowdell', 'Waelens', 'Sheerlinck', 'McDermott', 'Carrau', 'Ilett',
       'Backstrom', 'Ford', 'Slocovski', 'Celotti', 'Christmann',
       'Andreasson', 'Chaffee', 'Dean', 'Coxon', 'Shorney', 'Goldschmidt',
       'Greenfield', 'Doling', 'Kantor', 'Petranec', 'Petroff', 'White',
       'Johansson', 'Gustafsson', 'Mionoff', 'Salkjelsvik', 'Moss',
       'Rekic', 'Porter', 'Zabour', 'Barton', 'Jussila', 'Attalah',
       'Pekoniemi', 'Connors', 'Baxter', 'Hickman', 'Moore', 'Webber',
       'McMahon', 'Madsen', 'Peter', 'Ekstrom', 'Drazenoic', 'Coelho',
       'Robins', 'Weisz', 'Sobey', 'Richard', 'Newsom', 'Osen', 'Giglio',
       'Boulos', 'Nysten', 'Hakkarainen', 'Burke', 'Andrew', 'Nicholls',
       'Navratil', 'Byles', 'Bateman', 'Pears', 'Meo', 'van Billiard',
       'Olsen', 'Gilnagh', 'Corn', 'Smiljanic', 'Sage', 'Cribb', 'Watt',
       'Bengtsson', 'Calic', 'Goldsmith', 'Chibnall', 'Baumann', 'Ling',
       'Van der hoef', 'Sivola', 'Smith', 'Klasen', 'Lefebre', 'Isham',
       'Hale', 'Leonard', 'Pernot', 'Becker', 'Kink-Heilmann', 'Rood',
       "O'Brien", 'Romaine', 'Bourke', 'Turcin', 'Pinsky', 'Carbines',
       'Andersen-Jensen', 'Brown', 'Lurette', 'Mernagh', 'Madigan',
       'Yrois', 'Vande Walle', 'Johanson', 'Youseff', 'Cohen', 'Strom',
       'Albimona', 'Carr', 'Blank', 'Ali', 'Cameron', 'Perkin', 'Givard',
       'Kiernan', 'Newell', 'Honkanen', 'Jacobsohn', 'Bazzani',
       'Sunderland', 'Bracken', 'Green', 'Nenkoff', 'Hoyt', 'Berglund',
       'Mellors', 'Lovell', 'Fahlstrom', 'Larsson', 'Sjostedt', 'Leyson',
       'Harknett', 'Hold', 'Collyer', 'Pengelly', 'Hunt', 'Murphy',
       'Coleridge', 'Maenpaa', 'Minahan', 'Lindahl', 'Hamalainen',
       'Beckwith', 'Carter', 'Reed', 'Stead', 'Lobb', 'Rosblom', 'Touma',
       'Thorne', 'Cherry', 'Ward', 'Parrish', 'Taussig', 'Harrison',
       'Henry', 'Reeves', 'Persson', 'Graham', 'Bissette', 'Cairns',
       'Tornquist', 'Mellinger', 'Natsch', 'Healy', 'Andrews', 'Lindblom',
       'Parkes', 'Abbott', 'Duane', 'Olsson', 'de Pelsmaeker', 'Dorking',
       'Stankovic', 'de Mulder', 'Naidenoff', 'Hosono', 'Connolly',
       'Barber', 'Bishop', 'Levy', 'Haas', 'Mineff', 'Lewy', 'Hanna',
       'Allison', 'Saalfeld', 'Kelly', 'McCoy', 'Keane', 'Fleming',
       'Penasco y Castellana', 'Abelson', 'Francatelli', 'Hays',
       'Ryerson', 'Lahtinen', 'Hendekovic', 'Hart', 'Nilsson', 'Moraweck',
       'Wick', 'Spedden', 'Dennis', 'Danoff', 'Slayter', 'Young',
       'Nysveen', 'Ball', 'Hippach', 'Partner', 'Frauenthal', 'Denkoff',
       'Burns', 'Dahl', 'Blackwell', 'Collander', 'Sedgwick', 'Fox',
       'Davison', 'Coutts', 'Dimic', 'Odahl', 'Williams-Lambert', 'Elias',
       'Yousif', 'Vanden Steen', 'Bowerman', 'Funk', 'McGovern',
       'Mockler', 'del Carlo', 'Barbara', 'Asim', 'Adahl', 'Warren',
       'Moussa', 'Jermyn', 'Aubart', 'Harder', 'Wiklund', 'Beavan',
       'Ringhini', 'Landergren', 'Widener', 'Betros', 'Bidois', 'Nakid',
       'Tikkanen', 'Plotcharsky', 'Davies', 'Buss', 'Sadlier', 'Lehmann',
       'Jansson', 'McKane', 'Pain', 'Trout', 'Niskanen', 'Adams',
       'Oreskovic', 'Gale', 'Widegren', 'Richards', 'Birkeland',
       'Sdycoff', 'Cunningham', 'Sundman', 'Meek', 'Drew', 'Silven',
       'Matthews', 'Van Impe', 'Gheorgheff', 'Charters', 'Zimmerman',
       'Danbom', 'Wiseman', 'Clarke', 'Phillips', 'Flynn', 'Pickard',
       'Bjornstrom-Steffansson', 'Thorneycroft', 'Louch', 'Kallio',
       'Silvey', 'Kvillner', 'Hampe', 'Petterson', 'Reynaldo',
       'Johannesen-Bratthammer', 'Dodge', 'Seward', 'Baclini', 'Peuchen',
       'Hagland', 'Foreman', 'Goldenberg', 'Peduzzi', 'Jalsevac',
       'Millet', 'Kenyon', 'Toomey', "O'Connor", 'Anderson', 'Morley',
       'Gee', 'Milling', 'Maisner', 'Goncalves', 'Campbell', 'Smart',
       'Scanlan', 'Keefe', 'Cacic', 'Jerwan', 'Strandberg', 'Clifford',
       'Renouf', 'Karlsson', 'Hirvonen', 'Frost', 'Rouse', 'Turkula',
       'Kent', 'Somerton', 'Windelov', 'Molson', 'Artagaveytia',
       'Stanley', 'Yousseff', 'Eustis', 'Shellard', 'Svensson', 'Canavan',
       "O'Sullivan", 'Laitinen', 'Maioni', 'Quick', 'Bradley', 'Lang',
       'Daly', 'McGough', 'Rothschild', 'Coleff', 'Walker', 'Lemore',
       'Ryan', 'Angle', 'Pavlovic', 'Vovk', 'Lahoud', 'Kassem', 'Farrell',
       'Ridsdale', 'Farthing', 'Salonen', 'Hocking', 'Toufik', 'Butt',
       'LeRoy', 'Risien', 'Frolicher', 'Crosby', 'Beane', 'Douglas',
       'Nicholson', 'Padro y Manent', 'Thayer', 'Sharp', 'Leeni', 'Ohman',
       'Wright', 'Duff Gordon', 'Robbins', 'de Messemaeker', 'Morrow',
       'Sivic', 'Norman', 'Simmons', 'Meanwell', 'Stoytcheff', 'Doharr',
       'Jonsson', 'Appleton', 'Rush', 'Patchett', 'Garside', 'Caram',
       'Christy', 'Downton', 'Ross', 'Paulner', 'Jarvis',
       'Frolicher-Stehli', 'Gilinski', 'Murdlin', 'Rintamaki',
       'Stephenson', 'Elsbury', 'Chapman', 'Leitch', 'Slabenoff',
       'Harrington', 'Torber', 'Homer', 'Lindell', 'Karaic', 'Daniel',
       'Shutes', 'Jardin', 'Horgan', 'Brocklebank', 'Herman', 'Gavey',
       'Yasbeck', 'Kimball', 'Hansen', 'Bowen', 'Sutton', 'Kirkland',
       'Longley', 'Bostandyeff', "O'Connell", 'Barkworth', 'Lundahl',
       'Stahelin-Maeglin', 'Parr', 'Davis', 'Leinonen', 'Jensen',
       'Sagesser', 'Foo', 'Cor', 'Simonius-Blumer', 'Willey', 'Mitkoff',
       'Kalvik', "O'Leary", 'Hegarty', 'Radeff', 'Eitemiller', 'Badt',
       'Colley', 'Lindqvist', 'Butler', 'Rommetvedt', 'Cook', 'Taylor',
       'Davidson', 'Mitchell', 'Wilhelms', 'Watson', 'Edvardsson',
       'Sawyer', 'Turja', 'Hoytt', 'Cardeza', 'Peters', 'Hassab',
       'Olsvigen', 'Dakic', 'Fischer', 'Madill', 'Dick', 'Karun', 'Lam',
       'Saad', 'Weir', 'Mullens', 'Humblen', 'Astor', 'Silverthorne',
       'Gallagher', 'Calderhead', 'Cleaver', 'Mayne', 'Klaber',
       'Greenberg', 'Soholt', 'Endres', 'Troutt', 'McEvoy', 'Gillespie',
       'Hodges', 'Chambers', 'Mannion', 'Bryhl', 'Ilmakangas', 'Hassan',
       'Knight', 'Berriman', 'Troupiansky', 'Lesurer', 'Ivanoff',
       'Nankoff', 'Hawksford', 'Cavendish', 'McNamee', 'Stranden',
       'Sinkkonen', 'Marvin', 'Connaghton', 'Wells', 'Moor',
       'Vande Velde', 'Jonkoff', 'Carlsson', 'Bailey', 'Theobald',
       'Rothes', 'Garfirth', 'Nirva', 'Barah', 'Eklund', 'Hogeboom',
       'Brewe', 'Mangan', 'Gronnestad', 'Lievens', 'Mack', 'Myhrman',
       'Tobin', 'Emanuel', 'Kilgannon', 'Robert', 'Ayoub', 'Long',
       'Johnston', 'Harmer', 'Sjoblom', 'Guggenheim', 'Gaskell',
       'Dantcheff', 'Otter', 'Leader', 'Osman', 'Ibrahim Shawah',
       'Ponesell', 'Thomas', 'Hedman', 'Pettersson', 'Alexander',
       'Lester', 'Slemen', 'Tomlin', 'Fry', 'Heininen', 'Mallet', 'Holm',
       'Lulic', 'Reuchlin', 'McCormack', 'Stone', 'Augustsson', 'Allum',
       'Compton', 'Pasic', 'Sirota', 'Chip', 'Marechal', 'Alhomaki',
       'Mudd', 'Serepeca', 'Lemberopolous', 'Culumovic', 'Abbing',
       'Markoff', 'Lines', 'Aks', 'Razi', 'Giles', 'Swift', 'Gill',
       'Bystrom', 'Duran y More', 'Roebling', 'van Melkebeke', 'Balkic',
       'Vander Cruyssen', 'Najib', 'Laleff', 'Potter', 'Shelley',
       'Markun', 'Dahlberg', 'Banfield', 'Sutehall', 'Montvila', 'Behr',
       'Dooley', 'Mr. Frederick Maxfield Hoyt'], dtype=object)

In [113]:
df['FirstName'].unique()

array([' Owen Harris', ' John Bradley (Florence Briggs Thayer)', ' Laina',
       ' Jacques Heath (Lily May Peel)', ' William Henry', ' James',
       ' Timothy J', ' Gosta Leonard',
       ' Oscar W (Elisabeth Vilhelmina Berg)', ' Nicholas (Adele Achem)',
       ' Marguerite Ru&5$$', ' Elizabeth', ' Hulda Amanda Adolfina',
       ' (Mary D Kingcome)', ' Eugene', ' Charles Eugene',
       ' Julius (Emelia Maria Vandemoortele)', ' Fatima', ' Joseph J',
       ' Lawrence', ' Anna "Annie"', ' Torborg Danira',
       ' Carl Oscar (Selma Augusta Emilia Johansson)', ' Farred Chehab',
       ' Charles Alexander', ' Ellen "Nellie"', ' Lalio', ' Manuel E',
       ' William Augustus (Marie Eugenie)', ' Mary Agatha', ' Edward H',
       ' Edgar Joseph', ' Alexander Oskar', ' Hanna', ' Ernest Charles',
       ' Augusta Maria', ' Jamila', ' Johan (Johanna Persdotter Larsson)',
       ' William John Robert (Dorothy Ann Wonnacott)', ' Theodor',
       ' Simonne Marie Anne Andree', ' Margaret Delia', ' William John',
       ' Denis', ' Bridget', ' Youssef', ' Josef (Josefine Franchi)',
       ' Juha Niilo', ' Richard Cater', ' Henry Sleeper (Myna Haxtun)',
       ' Lizzie (Elizabeth Anne Wilkinson)', ' Engelhart Cornelius',
       ' Hugh', ' Emily', ' Mansouer', ' Constance Mirium',
       ' William Frederick', ' Orsen', ' Amelie', ' Henry Birkhardt',
       ' Harald', ' Albert A', ' Gerios', ' (Elizabeth Ramell)',
       ' Ernest James', ' Erna Alexandra', ' Vincenz', ' Stephen Curnow',
       ' Lillian Amy', ' Ambrose Jr', ' Apostolos', ' Lee',
       ' Sigurd Hansen', ' Ivan', ' Rahamin Haim', ' Alden Gates',
       ' Achille', ' Jan Baptist', ' Brigdet Delia', ' Francisco M',
       ' Bertha', ' Karl Alfred (Maria Mathilda Gustafsson)',
       ' William Neal', ' Selman Francis', ' Mabel Helen', ' Francesco',
       ' Emil', ' Paul Edvin', ' Herbert Fuller', ' Bertram Frank',
       ' Daniel', ' Charles Joseph', ' George B', ' William Bertram',
       ' John T (Ada Julia Bone)', ' Sinai', ' Matilda',
       ' Pastcho ("Pentcho")', ' Richard Frasar', ' Gustaf Joel',
       ' Anders Vilhelm', ' Stoytcho', ' Anna Kristine', ' Albert Johan',
       ' Tido', ' Walter Chamberlain', ' Hileni', ' David John',
       ' Katriina', ' Malake', ' Edvard', ' Patrick',
       ' William John Robert', ' Quigg Edmond', ' Ellis Anna Maria',
       ' Stanley George', ' Leonard Charles', ' Nicholas', ' Susan',
       ' Percival Wayland', ' Elias', ' Martin', ' Fridtjof Arne',
       ' Anna', ' Johan', ' Jozef', ' Domingos Fernandeo',
       ' Alexander A (Grace Charity Laury)',
       ' Leopold (Mathilde Francoise Pede)', ' Samuel James Hayden',
       ' Emile', ' Helen Monypeny', ' Jacques Heath', ' Olaf Elon',
       ' Victor', ' Joseph (Sultana)', ' Anna Sofia',
       ' Pekka Pietari (Elin Matilda Dolck)', ' Jeremiah',
       ' Edgardo Samuel', ' Joseph Charles',
       ' August Edvard ("Wennerstrom")', ' Robina Maggie "Ruby"',
       ' Michel ("Louis M Hoffman")', ' Thomas Roussel Davids',
       ' Robert James', ' Thomas (Edith Wearne)', ' Alfonzo',
       ' Austin Blyler', ' Ole Martin', ' Charles Duane',
       ' Katherine "Katie"', ' Harry', ' Mile', ' Thomas Henry',
       ' John Hatfield', ' James (Elizabeth "Bessie" Inglis Milne)',
       ' John Viktor', ' Jovo', ' Eino Viljami',
       ' Frank John William "Frankie"', ' (Edith Martha Bowerman)',
       ' William (Anna Bernhardina Karlsson)', ' John D', ' Wyckoff',
       ' Arthur', ' Eleanor Ileen', ' Antti Wilhelm', ' James Clinch',
       ' Klas Albin', ' Henry Forbes', ' Ann Elizabeth', ' Reginald',
       ' Lionel', ' Constance Gladys', ' Rene', ' Clarence Gustaf Hugo',
       ' Richard F', ' Luise Gretchen', ' Hugh Roscoe',
       ' Thomas (Johanna "Hannah" Godfrey)',
       ' Charles Hallace ("Mr C Rolmane")', ' John', ' Stjepan',
       ' (Rosa)', ' William', ' Carla Christine Nielsine', ' Michel M',
       ' James Joseph (Margaret Tobin)', ' Elise', ' Robert',
       ' Karl Siegwart Andreas', ' Margaret "Maggie"',
       ' Henriette ("Mrs Harbeck")', ' Nestor Cyriel', ' Frederick',
       ' Jakob Alfred', ' Gerious', ' Gurshon "Gus"', ' Telma Matilda',
       ' Karl Alfred', ' Nassef Cassem', ' Helen "Ellen"', ' Henry',
       ' Ahmed', ' Clear Annie', ' John Henry', ' Hans Kristensen',
       ' Philip', ' Madeleine', ' Eliina', ' Sidney Samuel', ' Albina',
       ' Walter', ' Victor Francis', ' James H', ' George Henry',
       ' Christo', ' Frederick Maxfield', ' Karl Ivar Sven',
       ' John Hall ("Henry")', ' Arne Jonas', ' Mathilde',
       ' Henry Birkhardt (Irene Wallach)', ' Bengt Edvin', ' Ernst Adolf',
       ' Lillian Gertrud', ' Robert William Norman', ' Alice Phoebe',
       ' Stephen', ' Marjorie "Lottie"', ' Frederick William', ' Thamine',
       ' Katherine "Kate"', ' Reginald Charles', ' Matti Alexanteri',
       ' Sleiman', ' William Edward', ' Agda Thorilda Viktoria',
       ' William (Anna)', ' Richard Leonard', ' Ernest Courtenay',
       ' James George', ' Wilhelm (Elna Matilda Persson)',
       ' William Thomas', ' William Arthur',
       ' Viktor (Helena Wilhelmina)', ' Darwis (Hanne Youssef Razi)',
       ' Gertrude Maybelle', ' Gladys', ' (Lutie Davis)', ' Thomas',
       ' Edvin Rojj Felix', ' Delia', ' David', ' Ernesti Arvid',
       ' Ernst Ulrik', ' William Thompson (Edith Junkins)', ' Amelia',
       ' Alexander', ' (Elizabeth Anne Maidment)', ' Charles H',
       ' Hanora "Nora"', ' Kornelia Theodosia', ' Augusta Charlotta',
       ' Francis "Frank"', ' Eric', ' Stanton (Rosa Hunt)', ' Frank',
       ' Nils Johan Goransson', ' Alfons', ' Edward Arthur',
       ' Richard William', ' Theodore', ' Penko', ' Masabumi', ' Kate',
       ' Dickinson H (Helen Walton)', ' Rene Jacques', ' Aloisia',
       ' Ervin G', ' Mansour', ' Helen Loraine', ' Adolphe',
       ' James (Helene DeLaudeniere Chaput)',
       ' Anna Katherine "Annie Kate"', ' Bernard', ' William Cahoone Jr',
       ' Nora A', ' Howard Hugh "Harry"', ' Hudson Trevor', ' Margaret',
       ' Victor de Satode (Maria Josefa Perez de Soto y Vallejo)',
       ' Samuel', ' Laura Mabel', ' Margaret Bechstein', ' Emily Borie',
       ' William (Anna Sylfven)', ' Ignjac', ' Benjamin',
       ' Helmina Josefina', ' Sinai (Miriam Sternin)', ' Ernest',
       ' Mary Natalie', ' Frederic Oakley (Margaretta Corning Stone)',
       ' Yoto', ' Hilda Mary', ' Albert Francis (Sylvia Mae Harbaugh)',
       ' George John Jr', ' Marie Grice', ' Johan Hansen',
       ' (Ada E Hall)', ' Frank John (Emily Alice Brown)',
       ' Jean Gertrude', ' Agnes', ' Austen', ' George Edward',
       ' Leo Edmondus', ' Henry William (Clara Heinsheimer)', ' Mitto',
       ' Thomas Clinton', ' Elizabeth Margaret', ' Karl Edwart',
       ' Stephen Weart', ' Edmond Roger', ' Alice Elizabeth',
       ' Erik Gustaf', ' Charles Frederick Waddington', ' Stanley Hubert',
       ' Amelia "Mildred"', ' Marion Elsie',
       ' Thomas Henry (Mary E Finck)', ' William Loch "William"',
       ' Jovan', ' Nils Martin', ' Fletcher Fellows', ' Tannous',
       ' Josef', ' Wazli', ' Leo Peter', ' Elsie Edith', ' Annie Clemmer',
       ' Mary', ' Helen Mary "Ellie"', ' Wilhelm', ' Sebastiano',
       ' (Catherine David)', ' Adola', ' Mauritz Nils Martin',
       ' Frank Manley (Anna Sophia Atkinson)', ' (Mantoura Boulos)',
       ' Annie', ' Leontine Pauline', ' George Achilles', ' Sante',
       ' Stina Viola', ' Edgar Joseph (Leila Saks)', ' Aurora Adelia',
       ' Harry Elkins', ' Karl Gideon', ' Rosalie', ' Maria ("Mary")',
       ' Juho', ' Alexander Oskar (Mary Aline Towner)', ' Vasil',
       ' Charles Henry', ' Sidney Leonard', ' Matthew', ' William Ernest',
       ' Carl Olof', ' Johan Birger', ' Marjorie',
       ' Hjalmar (Agnes Charlotta Bengtsson)', ' Erik', ' Elina',
       ' Peter David', ' Alfred', ' William H (Jessie L)', ' Juha',
       ' Mari Aina', ' Pekka Pietari', ' Marija', ' Shadrach',
       ' Carl/Charles Peter', ' William Rowe', ' Hans Martin Monsen',
       ' Ida', ' Todor', ' Daisy E', ' Alfred Fleming', ' Johan Julian',
       ' Thomas (Annie Louise Rowley)',
       ' James Vivian (Lulu Thorne Christian)', ' Lyyli Karoliina',
       ' Catharina', ' Stanio', ' Leo',
       ' Ernst Gilbert (Anna Sigrid Maria Brogren)', ' Viktor Richard',
       ' Phillippe', ' Charles V (Ada Maria Winfield)',
       ' Kate Florence ("Mrs Kate Louise Phillips Marshall")',
       ' Berk (Berk Trembisky)', ' Mauritz Hakan',
       ' Percival (Florence Kate White)',
       ' Charles Alexander (Alice Adelaide Slow)', ' Nikolai Erland',
       ' William Baird', ' Lucile Polk', ' Doolina Margaret "Daisy"',
       ' Sidney (Emily Hocking)', ' Mark', ' Johan Henrik Johannesson',
       ' Benjamin (Esther Ada Bloomfield)', ' Leon', ' Johan Emil',
       ' Encarnacion', ' Bernt', ' Washington', ' Madeleine Violet',
       ' Frederic Kimber', ' Marie Catherine', ' Arthur Godfrey',
       ' Edwy Arthur', ' Ingvald Olai Olsen', ' Benjamin Laventall',
       ' Samuel L', ' Joseph', ' Francis Davis', ' Frederick R (Marion)',
       ' Ellen', ' Maurice', ' Arthur H', ' Jacob Christian', ' Simon',
       ' Manuel Estanslas', ' John Montgomery', ' Helene Barbara',
       ' Luka', ' Edwy Arthur (Ada Mary Worth)',
       ' Amin S (Marie Marthe Thuillard)', ' Ida Sofia', ' George Quincy',
       ' Peter Henry', ' Lewis Richard', ' Nils August', ' Hildur E',
       ' Harold Victor', ' Anthony Wood "Archie"', ' Richard Henry',
       ' (Hedwig)', ' Dickinson H', ' Jeannie',
       ' Frederick Maxfield (Jane Anne Forby)', ' Edward Austin',
       ' Francis William', ' Eden Leslie "Neville"',
       ' Konrad Mathias Reiersen', ' Einar', ' Harry Markland', ' Ramon',
       ' Edward Roland', ' Elizabeth Mussey',
       ' Hudson J C (Bessie Waldo Daniels)', ' Olof', ' Petar',
       ' Bridget Mary', ' Kristina Sofia', ' Roberta',
       ' Victor de Satode', ' Frederick Charles (Jane Richards)',
       ' George ("George Arthur Brayton")', ' Henry Margido', ' Fang',
       ' Eugene Patrick', ' James Robert', ' Martin (Elizabeth L',
       ' Satio', ' William Anderson', ' (Amelia Milley)',
       ' William A (Florence "Mary" Agnes Hughes)', ' Stefo', ' Janko',
       ' Sarkis', ' Louis Albert (Ida Sophia Fischer)', ' Fared', ' Lucy',
       ' Johan Werner', ' Richard George', ' Phyllis May', ' Nakli',
       ' Joseph Jr', ' Catherine (Catherine Rizk)', ' Eva Miriam',
       ' Archibald Willingham', ' Samuel Beard', ' Hedwig Margaritha',
       ' Harriet R', ' Ingeborg Constanzia', ' Sigrid Elisabeth',
       ' Edward', ' Walter Donald', ' Arthur Ernest',
       ' Edward (Ethel Clarke)', ' Julian', ' Frank John',
       ' John Morgan Jr', ' John Borland Jr', ' Percival James R',
       ' Timothy', ' Fahim ("Philip Zenni")', ' Velin', ' George',
       ' (Lucille Christiana Sutherland) ("Mrs Morgan")',
       ' Emil (Tillie Mandelbaum)', ' Guillaume Joseph (Emma)',
       ' Thomas Rowan', ' Husein', ' Robert Douglas', ' (Marion Ogden)',
       ' Alfred J', ' Ilia', ' Nils (Alma Cornelia Berglund)', ' Carl',
       ' Edward Dale (Charlotte Lamson)', ' John Irwin ("Irving")',
       ' Alfred George John', ' Ethel', ' William Baird (Alice Munger)',
       ' Joseph (Maria Elias)', ' Eiriik', ' Julie Rachel',
       ' John Borland (Marian Longstreth Morris)', ' William James',
       ' John Hugo', ' Uscher', ' Ruth', ' John Denzil', ' Maxmillian',
       ' Eliezer', ' Matti', ' Walter Bertram (Martha Eustis)',
       ' Jean Baptiste', ' Jessie Wills', ' Cosmo Edmund ("Mr Morgan")',
       ' Sidney Samuel (Amy Frances Christy)', ' Petco', ' Ernst William',
       ' Harry ("Mr E Haven")', ' Edvard Bengtsson', ' Milan',
       ' Robert Williams', ' Joseph (Juliette Marie Louise Lafargue)',
       ' Elizabeth W', ' Anders Johan (Alfrida Konstantia Brogren)',
       ' Jose Neto', ' Margaret Jane', ' William Alfred', ' Alice',
       ' Ernst Gilbert', ' William Arthur (Cordelia K Stanlick)',
       ' Marion Louise', ' Antoni', ' Edwin Nelson Jr', ' Sahid',
       ' Henry Damsgaard', ' David John "Dai"', ' Charles Leonard',
       ' Gretchen Fiske', ' Guentcho', ' Patrick D',
       ' Algernon Henry Wilson', ' Johan Svensson', ' Max',
       ' William Henry Marsh', ' Mabel', ' Antti Gustaf', ' Harvey',
       ' Juha (Maria Emilia Ojala)', ' Percival', ' Hans Peder', ' Emma',
       ' Margit Elizabeth', ' Choong', ' Eugenie', ' Henry Sleeper',
       ' Liudevit', ' Oberst Alfons', ' Amy Zillah Elsie', ' Mito',
       ' Elsie', ' Johannes Halvorsen', ' Hanora "Norah"',
       ' Leonard Mark', ' John (Catherine)', ' George Floyd',
       ' Arthur Webster', ' Henry William', ' Mohamed', ' Edward Pomeroy',
       ' Peju', ' Eino William', ' Lewis', ' Reginald Fenton',
       ' Knud Paust', ' Jacob', ' Elmer Zebley (Juliet Cummins Wright)',
       ' Thomas William Solomon (Elizabeth Catherine Ford)', ' Thornton',
       ' Henry Michael', ' Charles', ' Ennis Hastings', ' Gustaf Hjalmar',
       ' Frederick Charles', ' Thomas Drake Martinez', ' Katie',
       ' Hammad', ' Thor Anderson', ' Charles Edward',
       ' Thomas William Solomon', ' Joseph Philippe Lemercier',
       ' Jaako Arnold', ' Branko', ' Eberhard Thelander',
       ' Georgette Alexandra', ' Albert Adrian', ' Manca', ' Ali',
       ' Khalil', ' John Borland', ' Adolf Mathias Nicolai Olsen',
       ' John Jacob (Madeleine Talmadge Force)', ' Spencer Victor',
       ' Saiide', ' Henrik Juul', ' Henry Samuel ("Mr Henry Marshall")',
       ' Florence "Fannie"', ' Edward Pennington',
       ' Halim Gonios ("William George")',
       ' Berthe Antonine ("Mrs de Villiers")', ' Herman', ' Elmer Zebley',
       ' August Viktor', ' Peter Andreas Lauritz Andersen',
       ' Caroline Louise', ' Edwina Celia "Winnie"', ' Michael',
       ' Malkolm Joackim', ' Annie Jessie "Nina"', ' Svend Lauritz',
       ' Henry Price', ' Norman Campbell',
       ' Peter Henry (Lillian Jefferys)', ' Margareth',
       ' Kurt Arnold Gottfrid', ' Pieta Sofia', ' Elisabeth Walton',
       ' Houssein G N', ' Robert J', ' Moses Aaron', ' Leslie',
       ' Edward (Margaret Ann Watson)', ' Gustave J', ' Kanio', ' Minko',
       ' Walter James', ' Tyrell William', ' Susan Parker "Suzette"',
       ' Neal', ' Edward Gifford', ' Rossmore Edward', ' Daniel Warner',
       ' Joan', ' Meier', ' Johannes Joseph', ' Samuel (Jane Laver)',
       ' Viljo', ' August Sigfrid', ' Percy Andrew', ' Thomas Leonard',
       ' of (Lucy Noel Martha Dyer-Edwards)', ' Iisakki Antino Aijo',
       ' Hanna Assi', ' William Ernest (Lucile Polk)', ' Hans Linus',
       ' John C (Anna Andrews)', ' Arthur Jackson', ' Daniel J',
       ' Daniel Danielsen', ' Rene Aime', ' Niels Peder', ' (Mary)',
       ' Dibo', ' Elizabeth (Eliza Needs)', ' Pehr Fabian Oliver Malkolm',
       ' Roger', ' Virginia Ethel', ' Thomas J',
       ' Edward Scott (Elisabeth Walton McMillan)', ' Banoura',
       ' Albert Adrian (Vera Gillespie)', ' Milton Clyde', ' Andrew G',
       ' Abraham (David Lishin)', ' George Hugh', ' Bertram Vere',
       ' Andrew "Andy"', ' Stella Anna', ' William Fisher', ' Ristiu',
       ' Richard', ' Alice (Farnham)', ' Mara', ' Yousseff',
       ' Jean Baptiste (Rosalie Paula Govaert)',
       ' Harvey (Charlotte Annie Tate)', ' William Thornton II',
       ' Assad Alexander', ' Oskar Arvid', ' Karl Johan', ' Thomas Jr',
       ' Ellen Natalia', ' August', ' Norman Campbell (Bertha Griggs)',
       ' Richard James', ' Ebba Iris Alfrida', ' Ernest Portage',
       ' Wendla Maria', ' Albert', ' John Fredrik Alexander',
       ' Karl Thorsten', ' Charles Melville (Clara Jennings Gregg)',
       ' Nikola', ' John George', ' (Beila)', ' Urho Abraham', ' Len',
       ' Andre', ' Thomas Joseph', ' George Nelson (Martha Evelyn)',
       ' Antoni (Selini Alexander)', ' George Sibley', ' Amin',
       ' Owen George', ' Sara Rebecca', ' Jakob', ' Chang', ' Pierre',
       ' Ilmari Rudolf', ' Thomas Charles', ' Augusta', ' Peter L',
       ' Jeso', ' Anthony', ' Douglas Bullen', ' Marin',
       ' Samuel L (Edwiga Grabowska)', ' Sigvard Harald Elias',
       ' Nourelain', ' Mary Conover', ' Ernest Courtenay (Lilian Hughes)',
       ' Sam (Leah Rosen)', ' George Dennick (Mary Hitchcock)',
       ' Peter Denis', ' Solomon (Latifa Qurban)', ' Raihed',
       ' Claus Peter', ' Frederick Edward',
       ' Frederick Joel (Margaret Welles Barron)',
       ' Dorothy Edith "Dolly"', ' John William', ' (Karolina)',
       ' Asuncion', ' Washington Augustus II', ' Philemon',
       ' Harold Theodor', ' Cerin', ' Richard Leonard (Sallie Monypeny)',
       ' Frans Olof', ' Samuel (Hannah Wizosky)', ' Adele Kiamie "Jane"',
       ' Alfred Ossian', ' Nedelio', ' Kristo',
       ' Thomas Jr (Lily Alexenia Wilson)',
       ' William (Imanita Parrish Hall)', ' Johann', ' Gerda Ulrika',
       ' Frederick James', ' Henry Jr', ' William (Margaret Norton)',
       ' Juozas', ' Margaret Edith', ' Catherine Helen "Carrie"',
       ' Karl Howell', 'No Value'], dtype=object)

##### As we can see we have 2 problems. The first one is because one of the person keep having the firstname and the lastname in the same column so we have to fix this.

In [114]:
df['FirstName'] = df['FirstName'].replace('No Value', 'Frederick Maxfield')

In [116]:
df['LastName'] = df['LastName'].replace('Mr. Frederick Maxfield Hoyt', 'Hoyt')

##### And the second one is this, because we have this lastname that its wrong.

In [119]:
df['FirstName'] = df['FirstName'].replace(' Marguerite Ru&5$$',' Marguerite')